Repository: brownman/do_for_others_first_old
Catalog: project/install1/src/OLD/hotkeys/1/hotkeys.sh/old1/BAK/gxmessage_patch/gxmessage-2.20.0/po/*.po
Languages: sk

source: %s - a GTK-based xmessage clone
sk: %s - klon xmessage zalo¾ený na GTK

source: Usage: %s [OPTIONS] message ...
sk: Pou¾itie: %s [PREPÍNAÈE] správa ...

source: %s [OPTIONS] -file FILENAME
sk: %s [PREPÍNAÈE] -file MENOSÚBORU

source: xmessage options: -file FILENAME Get message text from file, '-' for stdin -buttons BUTTON_LIST List of "LABEL:EXIT_CODE", comma separated -default LABEL Give keyboard focus to the specified button -print Send the selected button's LABEL to stdout -center Try to open window in the centre of the screen -nearmouse Try to open window near the mouse pointer -timeout SECONDS Exit with code 0 after SECONDS seconds
sk: xmessage prepínaèe: -file MENOSÚBORU Prevezme text správy zo súboru, '-' pre ¹tandartný vstup -buttons ZOZNAM Zoznam hodnôt "MENO:EXIT_KÓD", oddelených èiarkou -default MENO Prednastaví ¹pecifikované tlaèidlo -print Vlo¾í meno zvoleného tlaèidla na ¹tandartný výstup -center Pokúsi sa otvori» okno v strede obrazovky -nearmouse Pokúsi sa otvori» okno v blízkosti kurzoru my¹i -timeout SEKÚND Ukonèí s kódom 0 za èas SEKÚND

source: X-like options: -display DISPLAY X display to use -fn FONT | -font FONT Set message font (works with GTK font names) -fg COLOUR Set message font colour -bg COLOUR Set message background colour -geometry GEOMETRY Set window size (position will be ignored) -iconic Start iconified -name NAME Program name as used by the window manager -title TITLE Set window title to TITLE
sk: X-like prepínaèe: -display OBRAZOVKA Pou¾ije zadanú X obrazovku -fn FONT | -font FONT Nastaví font správy (pracuje s GTK menami fontov) -fg FARBA Nastaví farbu fontu správy -bg FARBA Nastaví farbu pozadia správy -geometry GEOMETRIA Nastaví veµkos» okna (pozícia bude ignorovaná) -iconic Spustí sa minimalizované -name MENO Meno programu pou¾ité vo window mana¾éri -title TITULOK Nastaví titulok okna

source: %s: can't have both -entry and -print
sk: %s: nemô¾em pou¾i» súèasne -entry a -print

source: %s: can't get message from both -file and command line
sk: %s: nemô¾em súèasne prevzia» správu z -file aj z príkazového riadku

source: %s: integer -timeout value expected
sk: %s: -timeout oèakáva hodnotu integer

source: %s: unable to read file
sk: %s: nedoká¾em èíta» súbor

source: %s: message text is required
sk: %s: je po¾adovaný text správy

source: Try `%s --help' for more information
sk: Skúste `%s --help' pre viac informácií
